app/views/perks/_form.html.erb

      <%= f.label :brand_id %><br>
      <%= collection_select(:perk, :brand_id, Brand.all, :id, :brand_name, prompt: true) %>
---
SELECT "brands".* FROM "brands"