app/views/perks/index.html.erb

SELECT "perks".* FROM "perks"  ORDER BY "perks"."created_at" DESC
---
                     <% if current_user %>
                        <% unless @user.perks.include?(perk) %>