app/views/favourites/_favourite_buttons.html.erb

SELECT  "favourites".* FROM "favourites" WHERE "favourites"."perk_id" = $1 AND "favourites"."user_id" = $2 LIMIT 1  [["perk_id", 10], ["user_id", 11]]
---

  <form method='post' action='/favourites' id='heart' <%if (perk.favourites.find_by(user_id: current_user.id))%>class='hidden'<%end%>>