app/controllers/brands_controller.rb

SELECT "brands".* FROM "brands"
---
  def index
    @brands = Brand.all.paginate(:page => params[:page],:per_page => 20)

SELECT  "brands".* FROM "brands" WHERE "brands"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "perks".* FROM "perks" WHERE "perks"."brand_id" = $1 LIMIT 1  [["brand_id", 1]]
---
  def show
    @brand = Brand.find(params[:id])
    @perk = Perk.find_by(:brand_id => @brand.id)