app/controllers/categories_perks_controller.rb

  def index
    @categories_perks = CategoriesPerk.all
---
SELECT "categories_perks".* FROM "categories_perks"