app/controllers/categories_controller.rb

  def index
    @categories = Category.all
    @perks = Perk.all
---
SELECT "perk_categories".* FROM "perk_categories"
SELECT "perks".* FROM "perks"

  def show
    @category = Category.find(params[:id])
    @perk_category = PerkCategory.find_by(:category_id => params[:id])
    @perk = Perk.find_by(:id =>@perk_category.perk.id)
    @brand = Brand.find_by(:id => @perk.brand_id)
---
SELECT  "perk_categories".* FROM "perk_categories" WHERE "perk_categories"."category_id" = $1 LIMIT 1  [["category_id", 1]]
SELECT  "perks".* FROM "perks" WHERE "perks"."id" = $1 LIMIT 1  [["id", 8]]
SELECT  "brands".* FROM "brands" WHERE "brands"."id" = $1 LIMIT 1  [["id", 3]]