app/controllers/favourites_controller.rb

SELECT "perks".* FROM "perks"
---
  def index
    @user = current_user
    @favourites = @user.favourites.all
    @perks = Perk.all

SELECT  "perks".* FROM "perks" WHERE "perks"."id" = $1 LIMIT 1  [["id", nil]]
---
  def create
    @perk = Perk.find(params[:perk_id])