app/controllers/perks_users_controller.rb

SELECT "perks_users".* FROM "perks_users"
---
  def index
    @perks_users = PerksUser.all