app/controllers/perks_controller.rb

  def index
    # Tried to paginate manually until I found a cool gem that does it for me
    # start = 0
    # stop = 19
    # @perks = Perk.all.order(created_at: :desc)[start..stop]
    @perks = Perk.all.order(created_at: :desc).paginate(:page => params[:page])
    @user = current_user
    @user_perks = @user.perks.all
---
SELECT "perks".* FROM "perks"  ORDER BY "perks"."created_at" DESC
SELECT "perks".* FROM "perks"

  def show
    @perk = Perk.find(params[:id])
    @brand = Brand.find_by(:id => @perk.brand_id)
    @favourites = Favourite.find_by(:perk_id => params[:id])
---
SELECT  "perks".* FROM "perks" WHERE "perks"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "brands".* FROM "brands" WHERE "brands"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "favourites".* FROM "favourites" WHERE "favourites"."perk_id" = $1 LIMIT 1  [["perk_id", 11]]

  def edit
    @perk = Perk.find(params[:id])
---
SELECT  "perks".* FROM "perks" WHERE "perks"."id" = $1 LIMIT 1  [["id", 11]]

  def create
    @brands = Brand.all
    @user = current_user
    @perk = @user.perks.new(perk_params)
    @favourites = @perk.favourites.all.order(created_at: :desc)
    respond_to do |format|
      if @perk.save
---
INSERT INTO "perks" ("title", "discount", "address", "city", "state", "zipcode", "brand_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def update
    @perk = Perk.find(params[:id])
    respond_to do |format|
      if @perk.update(perk_params)
---
SELECT  "perks".* FROM "perks" WHERE "perks"."id" = $1 LIMIT 1  [["id", 11]]
UPDATE "perks" SET "zipcode" = $1, "updated_at" = $2 WHERE "perks"."id" = $3  [["zipcode", "94087"], ["updated_at", "2015-11-01 01:13:07.949563"], ["id", 11]]

  def destroy
    @perk.destroy
---
DELETE FROM "perks" WHERE "perks"."id" = $1  [["id", 11]]

    def set_perk
      @perk = Perk.find(params[:id])
---
SELECT  "perks".* FROM "perks" WHERE "perks"."id" = $1 LIMIT 1  [["id", nil]]