app/controllers/perk_categories_controller.rb

  def index
    @perk_categories = PerkCategory.all
    @categories = Category.all
    @perks = Perk.all
---
SELECT "perk_categories".* FROM "perk_categories"
SELECT "perks".* FROM "perks"

  def show
    @perk_category = PerkCategory.find(params[:id])
    @perk_brand = Perk.find(:brand_id => @perk_category.perk.brand_id)
---
SELECT  "perk_categories".* FROM "perk_categories" WHERE "perk_categories"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "perks".* FROM "perks" WHERE "perks"."id" = $1 LIMIT 1  [["id", 6]]

    def set_perk_category
      @perk_category = PerkCategory.find(params[:id])
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT 1  [["id", 2]]